apache/nuttx/arch/arm/src/common/stm32/stm32_otgfsdev_m3m4_v1.c
  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: stm32_req_dispatch
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static int stm32_req_dispatch(struct stm32_usbdev_s *priv,
                              const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl,
                        priv->ep0data, priv->ep0datlen);
    }

  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(STM32_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: stm32_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void stm32_usbreset(struct stm32_usbdev_s *priv)
{
  struct stm32_ep_s *privep;
  uint32_t regval;
  int i;

  /* Clear the Remote Wake-up Signaling */

  regval = stm32_getreg(STM32_OTGFS_DCTL);
  regval &= ~OTGFS_DCTL_RWUSIG;
  stm32_putreg(regval, STM32_OTGFS_DCTL);

  /* Flush the EP0 Tx FIFO */

  stm32_txfifo_flush(OTGFS_GRSTCTL_TXFNUM_D(EP0));

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = STM32_EP_AVAILABLE;
  priv->epavail[1] = STM32_EP_AVAILABLE;

  /* Disable all end point interrupts */

  for (i = 0; i < STM32_NENDPOINTS ; i++)
    {
      /* Disable endpoint interrupts */

      stm32_putreg(0xff, STM32_OTGFS_DIEPINT(i));
      stm32_putreg(0xff, STM32_OTGFS_DOEPINT(i));

      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      stm32_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      stm32_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;
    }

  stm32_putreg(0xffffffff, STM32_OTGFS_DAINT);

  /* Mask all device endpoint interrupts except EP0 */

  regval = (OTGFS_DAINT_IEP(EP0) | OTGFS_DAINT_OEP(EP0));
  stm32_putreg(regval, STM32_OTGFS_DAINTMSK);

  /* Unmask OUT interrupts */

  regval = (OTGFS_DOEPMSK_XFRCM | OTGFS_DOEPMSK_STUPM | OTGFS_DOEPMSK_EPDM);
  stm32_putreg(regval, STM32_OTGFS_DOEPMSK);

  /* Unmask IN interrupts */

  regval = (OTGFS_DIEPMSK_XFRCM | OTGFS_DIEPMSK_EPDM | OTGFS_DIEPMSK_TOM);
  stm32_putreg(regval, STM32_OTGFS_DIEPMSK);

  /* Reset device address to 0 */

  stm32_setaddress(priv, 0);
  priv->devstate = DEVSTATE_DEFAULT;
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  stm32_ep0_configure(priv);

  /* Setup EP0 to receive SETUP packets */

  stm32_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: stm32_ep0out_testmode
 *
 * Description:
 *   Select test mode
 *
 ****************************************************************************/

static inline void stm32_ep0out_testmode(struct stm32_usbdev_s *priv,
                                         uint16_t index)
{
  uint8_t testmode;

  testmode = index >> 8;
  switch (testmode)
    {
      case 1:
        priv->testmode = OTGFS_TESTMODE_J;
        break;

      case 2:
        priv->testmode = OTGFS_TESTMODE_K;
        break;

      case 3:
        priv->testmode = OTGFS_TESTMODE_SE0_NAK;
        break;

      case 4:
        priv->testmode = OTGFS_TESTMODE_PACKET;
        break;

      case 5:
        priv->testmode = OTGFS_TESTMODE_FORCE;
        break;

      default:
        usbtrace(TRACE_DEVERROR(STM32_TRACEERR_BADTESTMODE), testmode);
        priv->dotest   = false;
        priv->testmode = OTGFS_TESTMODE_DISABLED;
        priv->stalled  = true;
    }

  priv->dotest = true;
  stm32_ep0in_transmitzlp(priv);
}

/****************************************************************************
 * Name: stm32_ep0out_stdrequest
 *
 * Description:
 *   Handle a standard request on EP0.  Pick off the things of interest to
 *   the USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static inline void stm32_ep0out_stdrequest(struct stm32_usbdev_s *priv,
                                           struct stm32_ctrlreq_s *
                                           ctrlreq)
{
  struct stm32_ep_s *privep;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
      case USB_REQ_GETSTATUS:
        {
          /* type:  device-to-host; recipient = device, interface, endpoint
           * value: 0
           * index: zero interface endpoint
           * len:   2; data = status
           */

          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_GETSTATUS), 0);
          if (!priv->addressed ||
               ctrlreq->len != 2 ||
              USB_REQ_ISOUT(ctrlreq->type) ||
              ctrlreq->value != 0)
            {
              priv->stalled = true;
            }
          else
            {
              switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
                {
                  case USB_REQ_RECIPIENT_ENDPOINT:
                    {
                      usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_EPGETSTATUS),
                               0);
                      privep = stm32_ep_findbyaddr(priv, ctrlreq->index);
                      if (!privep)
                        {
                          usbtrace(
                            TRACE_DEVERROR(STM32_TRACEERR_BADEPGETSTATUS),
                            0);
                          priv->stalled = true;
                        }
                      else
                        {
                          if (privep->stalled)
                            {
                              priv->ep0data[0] =
                                (1 << USB_FEATURE_ENDPOINTHALT);
                            }
                          else
                            {
                              priv->ep0data[0] = 0; /* Not stalled */
                            }

                          priv->ep0data[1] = 0;
                          stm32_ep0in_setupresponse(priv, priv->ep0data, 2);
                        }
                    }
                    break;

